/*
	common_pleaseModifyThisWhenPorting.hpp

	�ֿ� ���ĵ鿡 ���� ���� �� �������̽� �Լ��鿡 ���� ������ ���� �ִ� ��� �����Դϴ�.

	TODO ���� �������� �����ؾ� �Ҹ��� ��ҵ��� ��� �� ��� ���Ͽ� ��� �ξ����ϴ�. �ʿ�� ������ �ּ���.

	
*/

#pragma once

/*
	TODO ��� �÷����� ���� �޸� �����ؾ� �� �κ��� ���� ��� �̸� �����ϱ� ���� �Ʒ� #define�� �� �ϳ��� Ȱ��ȭ�Ͽ� ����մϴ�.

	(�̸��� �켱 ���Ƿ� ������ �ξ����ϴ�)
*/
//#define WIN64
#define JNI
//#define iOS



#ifdef WIN64

#include <opencv2/core/utility.hpp>
#include <opencv2/imgcodecs.hpp>
#include <opencv2/imgproc.hpp>
#include <opencv2/videoio.hpp>
#include <opencv2/highgui.hpp>
#include <opencv2/features2d.hpp>
#include <opencv2/calib3d.hpp>

#endif

#ifdef JNI

#include "opencv2/core/utility.hpp"
#include "opencv2/imgcodecs.hpp"
#include "opencv2/imgproc.hpp"
#include "opencv2/videoio.hpp"
#include "opencv2/highgui.hpp"
#include "opencv2/features2d.hpp"
#include "opencv2/calib3d.hpp"

#endif

#ifdef iOS

#include "opencv2/core/utility.hpp"
#include "opencv2/imgcodecs.hpp"
#include "opencv2/imgproc.hpp"
#include "opencv2/videoio.hpp"
#include "opencv2/highgui.hpp"
#include "opencv2/features2d.hpp"
#include "opencv2/calib3d.hpp"

#endif

namespace lpin
{
	// ���� ������� �����ϱ� ���� Ŭ�����Դϴ�.
	class Constants
	{
	private:
		~Constants() = delete;
	public:
		// ����� ���� ������ ��Ÿ���� ���Դϴ�. Initialize() ȣ��� ���޹��� �μ� ���� ���Ͽ� ȣȯ�� ���θ� �����ϴµ� ���Դϴ�.
		static constexpr double version = 0.2;

		// ����� ȣȯ ������ �ּ� ������ ��Ÿ���� ���Դϴ�. Initialize() ȣ��� ���޹��� �μ� ���� ���Ͽ� ȣȯ�� ���θ� �����ϴµ� ���Դϴ�.
		// ���� metadata ����� �ּ� ������ �޶��� �� �ֽ��ϴ�.
		static constexpr double min_version = 0.1;

		// Feature point matching�� ��ȿ�� pair ���θ� �����ϱ� ���� ���Ǵ� threshold ���Դϴ�.
		static constexpr float threshold = 0.7f;

		// ���� ������ ũ�⸦ �����ϴ� ���Դϴ�.
		static constexpr size_t buffer_size = 80 * 1024 * 1024;

		// Marker �ֺ��� �󸶸�ŭ�� ��� �� ������ ����� �������� �����ϴ� ���Դϴ�.
		static constexpr double base_marker_width_ratio = 0.1;

		// ��� ���ο��� image�� � ũ��� crop / resize�Ͽ� ��������� �����ϴ� ���Դϴ�.
		static constexpr int base_img_width = 256;

		// ��� ���ο��� image�� � ũ��� crop / resize�Ͽ� ��������� �����ϴ� ���Դϴ�.
		static constexpr int base_img_height = 256;

#ifdef WIN64

		// Byte array�� �ܺ� image Data�� ������ ��� �ش� array�� ������ ��Ÿ���� ���Դϴ�.
		// ��κ��� ��� 24b bitmap���� ���� ������ ����Ǹ� �׿� ���߾� initialize�� �ξ����ϴ�. �ʿ�� �����ؾ� �� ���� �ֽ��ϴ�.
		static constexpr int external_img_type = CV_8UC3;

		static constexpr int external_img_convertCode = cv::COLOR_BGR2GRAY;
#endif
#ifdef JNI
		// Byte array�� �ܺ� image Data�� ������ ��� �ش� array�� ������ ��Ÿ���� ���Դϴ�.
		// ��κ��� ��� 24b bitmap���� ���� ������ ����Ǹ� �׿� ���߾� initialize�� �ξ����ϴ�. �ʿ�� �����ؾ� �� ���� �ֽ��ϴ�.
		static constexpr int external_img_type = CV_8UC4;

		static constexpr int external_img_convertCode = cv::COLOR_RGBA2GRAY;
#endif
#ifdef iOS
		// Byte array�� �ܺ� image Data�� ������ ��� �ش� array�� ������ ��Ÿ���� ���Դϴ�.
		// ��κ��� ��� 24b bitmap���� ���� ������ ����Ǹ� �׿� ���߾� initialize�� �ξ����ϴ�. �ʿ�� �����ؾ� �� ���� �ֽ��ϴ�.
		static constexpr int external_img_type = CV_8UC3;

		static constexpr int external_img_convertCode = cv::COLOR_RGBA2GRAY;
#endif
	};


	// GetStateCode()�� ȣ���Ͽ� Ȯ�� ������, ���� �������� ����� ���¸� �����ϱ� ���� enumerator�Դϴ�.
	enum StateCode : int
	{
		// �� �� ���� �ڵ�
		Not_Defined = 0x0,

		// ��û ó�� �Ұ�
		Not_Ready = 0x1,

		// ��û ó�� �Ұ� - ���� Initialize()�� ȣ����� ����
		Not_Initialized = 0x11,

		// ��û ó�� �Ұ� - �۾� ������
		Busy = 0x21,

		// ��û ó�� �Ұ� - �۾� ������ - �� ��ġ ���� ������
		RetrivingTargetData = 0x61,

		// ��û ó�� �Ұ� - �۾� ������ - ��ġ ���� ��û ó����
		ProcessingQueries = 0xA1,


		// ���� ����
		Idle = 0x2,

		// ���� ���� - ��Ŀ ��� ����
		ReadyToSetMarker = 0x2,

		// ���� ���� - ��Ŀ ���, �� ��ġ ���� ���� ����
		ReadyToRetriveTargetData = 0x12,

		// ���� ���� - ��Ŀ ���, �� ��ġ ���� ����, ��ġ ���� ��û ó�� ����
		ReadyToProcessQueries = 0x32,
	};

	/*
		�������̽� �Լ���
	*/

	// ���� �����ν� ����� ���� ���¿� �ش��ϴ� ���� return�մϴ�.
	int GetStateCode();

	// �����ν� ����� �ʱ�ȭ�մϴ�. �� ���� ���� ���� �� ���� ȣ��Ǿ�� �մϴ�.
	// ������ ����� ���� ���� ���� return�մϴ�.
	// �� ��° ������ ȣ���� ���õǸ� 0.0�� return�մϴ�.
	// �μ��� �־��� wrapper ���� ���� �ּ� ���� ������ ���� ��� �����ϸ� -1.0�� return�մϴ�. 
	double Initialize(double wrapper_version);

	// ��Ʈ�� ��/��¿� ���Ǵ� ���� ������ ���� ������ ���� return�մϴ�.
	char *GetPtrOfBuffer();

	// Marker �̹����� �����մϴ�. ���� ���θ� return�մϴ�.
	int SetMarker(cv::Mat img_marker);

	// Marker �̹����� �����մϴ�(byte array ����). ���� ���θ� return�մϴ�.
	int SetMarker(char *ptr_marker, int img_width, int img_height);

	// Marker �̹����� �����մϴ�(���� ��� ����). ���� ���θ� return�մϴ�.
	int SetMarker(int img_width, int img_height);

	// (�̱���)���� �������� Marker�� ���� metadata�� �о�� �����մϴ�.
	// ������ ��� ���������� �о�� ����Ʈ ���� return�մϴ�. ������ ��� 0�� return�մϴ�.
	int SetMarkerData();

	// �������� ����� �����մϴ�. ���� ���θ� return�մϴ�.
	int Start_RetriveTargetData();

	// �������� ����� �����ϴ�. ���� ���θ� return�մϴ�.
	int End_RetriveTargetData();

	// (�̱���)���� �������� ���������� �о�ɴϴ�.
	// ������ ��� ���������� �о�� ����Ʈ ���� return�մϴ�. ������ ��� 0�� return�մϴ�.
	int ImportTargetData();

	// (�̱���)���� ������ ���������� ����մϴ�.
	// ������ ��� ���������� ����� ����Ʈ ���� return�մϴ�. ������ ��� 0�� return�մϴ�.
	// ���� ���ο� �����ϰ� ���� ������ Data�� ����/�κ������� ����� �� �ֽ��ϴ�.
	int ExportTargetData();

	// ���������� �����մϴ�. ���� ���θ� return�մϴ�.
	int Start_ProcessQuery();

	// ���������� �����ϴ�. ���� ���θ� return�մϴ�.
	int End_ProcessQuery();

	// ������� ����� �������� �ŷڵ� ���� return�մϴ�.
	// ���������� ���� �� ���� �������� ���� ��� -1.0�� return�մϴ�.
	double GetConfidenceRate();

	// (�̱���)���� ������, ������� ���� ������ image�� �� �ŷڵ� ������ ���� ���������� �⿩�� image�� ����մϴ�.
	// ������ ��� ���������� ����� ����Ʈ ���� return�մϴ�.
	// ���������� ���� �� ���� �������� ���� ��� �����ϸ� -1�� return�մϴ�.
	// ���� ���ο� �����ϰ� �ش� ���� ������ Data�� ����/�κ������� ����� �� �ֽ��ϴ�.
	int ExportMostAccurateQueryImage();

	// �������� ��� �Ǵ� ���������� ���� image�� �Է��մϴ�.
	// ������ ��� �̹� �̹����� �� ��° �Է��̾�����(������ 1)�� return�մϴ�. ������ ��� 0�� return�մϴ�.
	int Process(cv::Mat img);

	// �������� ��� �Ǵ� ���������� ���� image�� �Է��մϴ�(byte array ����).
	// ������ ��� �̹� �̹����� �� ��° �Է��̾�����(������ 1)�� return�մϴ�. ������ ��� 0�� return�մϴ�.
	int Process(char *ptr_img, int img_width, int img_height);

	// �������� ��� �Ǵ� ���������� ���� image�� �Է��մϴ�(���� ��� ����).
	// ������ ��� �̹� �̹����� �� ��° �Է��̾�����(������ 1)�� return�մϴ�. ������ ��� 0�� return�մϴ�.
	int Process(int img_width, int img_height);
}